cloveretl.engine/examples/simpleExamples/data-in/other/hello_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:sayHelloTo soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="urn:helloService">
			<name xsi:type="xsd:string">Zbyněk</name>
		</ns1:sayHelloTo>
	</soapenv:Body>
</soapenv:Envelope>